app/controllers/category_controller.rb

  def show
    @categories = Category.all
    @category = Category.find(params[:id])
  	@posts = @category.posts.page(params[:page]).per(25)
---
SELECT "categories".* FROM "categories"
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."category_id" = ? LIMIT 25 OFFSET 0  [["category_id", 2]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."category_id" = ?  [["category_id", 2]]