app/controllers/post_controller.rb

  def show

    category = Category.find(params[:category_id])
  	@post = Post.find(params[:id])
  	@posts = category.posts.page(params[:page]).per(25)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "posts".* FROM "posts" WHERE "posts"."category_id" = ? LIMIT 25 OFFSET 0  [["category_id", 1]]
SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "posts" WHERE "posts"."category_id" = ?  [["category_id", 1]]